{
  "professors": [
    {
      "id": "1",
      "name": "Марјан",
      "surname": "Гушев",
      "email": "marjan.gushev@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_marjan_gushev_.jpg?itok=9qduxakX",
      "description": "Марјан Гушев, д-р на науки, работи како професор на Универзитетот Св. Кирил и Методиј (УКИМ), при факултетот за Информатички науки и компјутерско инженерство (Финки). Тој е искусен научник, професор и иноватор, менаџер и експерт, со големо знаење и длабоко разбирање на научните концепти од компјутерските науки и нивната примена во голем дел од проекти, вклучувајќи био-инженеринг на медицински сигнали, теле-медицина, решенија од ерата на пресметување на работ, пресметување во облак и роса, паралелно процесирање, имплементација на електронски сервиси, менаџмент на Универзитет, развој на ИТ стратегија и управување итн.",
      "grade": 4.533333333333333,
      "votes": 15,
      "reviews": [
        "adawdasd",
        "Најдобар !",
        "najak"
      ],
      "status": "Д-р "
    },
    {
      "id": "2",
      "name": "Катерина",
      "surname": "Здравкова",
      "email": "katerina.zdravkova@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_katerina_zdravkova_.jpg?itok=SAkYEw73",
      "description": "Родена е 1960 година во Скопје, каде што оформила основно и средно образование. На Математичкиот факултет се запишала во академската 1978/79 година Насоката математика и информатика ја завршила во 1983 година. Магистрирала на Електротехничкиот факултет во Скопје, на насоката за компјутерска техника и информатика (КТИ) под менторство на проф. д-р Драган Михајлов, во 1988 година, со одбрана на трудот “Алгоритми за генетски истражувања”. Докторирала на ПМФ во 1993 година, со одбрана на дисертацијата “Систем за машинско преведување, реализиран со помош на невронски мрежи”, под менторство на проф. д-р Душан Сурла од Уиверзитетот во Нови Сад.",
      "grade": 4.357142857142857,
      "votes": 7,
      "reviews": [
        "You are the best professor i have ever met in my life",
        "Greatest\n",
        ""
      ],
      "status": "Д-р "
    },
    {
      "id": "3",
      "name": "Сузана",
      "surname": "Лошковска",
      "email": "suzana.loshkovska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_suzana_loshkovska_.jpg?itok=T78UjLva",
      "description": "Родена е 1966 година во Скопје. Дипломирала и магистрирала на Електротехничкиот факултет во Скопје во 1988 и 1992 година, соодветно. Докторските студии ги завршила на Техничкиот универзитет во Виена, Австрија, во 1995 година. На Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје работи од февруари 1992 година, како помлад асистент, а во 1995 година e избрана за асистент. Во својата професионална кариера напредувала во звањата доцент, вонреден професор и редовен професор во 1997, 2002 и 2007 година, соодветно.",
      "grade": 4.705882352941177,
      "votes": 17,
      "reviews": [
        "",
        "Najdobra!\n",
        ""
      ],
      "status": "Д-р "
    },
    {
      "id": "4",
      "name": "Коста",
      "surname": "Митрески",
      "email": "kosta.mitreski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_kosta_mitreski_.jpg?itok=vOdo5EMf",
      "description": "Роден е 1957 година во Охрид. Дипломирал, магистрирал и докторирал на Електротехничкиот факултет во Скопје во 1981, 1994 и 2002 година, соодветно. Бил вработен во ЖТП Скопје како главен инженер од 1982 до 1987 година. На Електротехничкиот факултет во Скопје бил вработен како помлад асистент во 1987 год. Во 2002, 2007 и 2012 година ги стекнал звањата доцент, вонреден професор и редовен професор. Моментално е одговорен за неколку предмети од додипломски студии и е координатор и основоположник на магистерски студии од студиската програма Еко-информатика. Автор е на повеќе од 100 трудови публикувани во реномирани меѓународни научни списанија и зборници од конференции. Учесник е во повеќе од дваесетина апликативно истражувачки проекти и десетина билатерални и меѓународни проекти со повеќе универзитети од ЕУ и САД. Бил раководител и учесник на неколку ТЕМПУС проекти како и FP6,FP7 и H2020 проекти. Неговите истражувања се фокусирани во областите на еколошкото моделирање, просторно-временските и 3Д објекти и анализи, милтимедиските системи и интелигентните информациони системи.",
      "grade": 3.25,
      "votes": 4,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "5",
      "name": "Верица",
      "surname": "Бакева",
      "email": "verica.bakeva@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_verica_bakeva_smiljkova_20722.jpg?itok=8nLV2O_Z",
      "description": "Научна област на нејзин интерес се веројатносните модели и нивните примени, пред се, во теорија на кодирање и криптографија. Има објавено триесетина научни труда. Учествувала на повеќе конференции во земјата и странство со презентирање на свои трудови. Како помлад истражувач, учествувала во два, а како истражувач во пет проекти финансирани од Министерството за наука на Р.Македонија и во три меѓународни проекти. Автор е на пет учебници и на една збирка задачи за гимназиско и средно-стручно образование. Член е на Здружението на информатичарите на Македонија.",
      "grade": 2,
      "votes": 3,
      "reviews": [
        "",
        "Najdobrata profesorka",
        "asdsadas"
      ],
      "status": "Д-р "
    },
    {
      "id": "6",
      "name": "Владимир",
      "surname": "Трајковиќ",
      "email": "vladimir.trajkovik@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_vladimir_trajkovikj_20724.jpg?itok=lu0gNtqa",
      "description": "Роден е 1971 година во Скопје. Дипломирал, магистрирал и докторирал на Електротехничкиот факултет во Скопје во 1994, 1997 и 2003 година, соодветно. На Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје работи од 1997 година како асистент. Во 2004, 2008 и 2013 година ги стекнал звањата доцент, вонреден професор и редовен професор. Моментално е одговорен за неколку предмети на додипломски студии и три предмети на магистерски студии. Исто така држи предавања на магистерски студии на Институтот за социолошки, политички и правни истражувања при универзитетот “Св. Кирил и Методиј“ во Скопје. Автор е на повеќе од 200 трудови публикувани во реномирани меѓународни научни списанија и зборници од конференции. Учесник е во повеќе од триесетина апликативно истражувачки мултилатерални и билатерални проекти со повеќе универзитети од Европската унија и САД во чии рамки остварил бројни студиски престои. Неговите истражувања се фокусирани на областите: дистрибуирани компјутерски системи, системи за поддршка на образованието на далечина, сервисно ориентирани архитектури, мобилни сервиси и поврзано здравство.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "7",
      "name": "Ана",
      "surname": "Мадевска Богданова",
      "email": "ana.madevska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_ana_madevska_bogdanova_20721.jpg?itok=_1F_Amjx",
      "description": "Родена е 1967 година во Скопје. Основно и средно образование завршила во Скопје. Во 1991 година дипломирала на Институтот за информатика при ПМФ во Скопје како најдобар дипломиран студент во тековната академска година. На Институтот за информатика почнала и да работи како стручен соработник во 1992 година. Во 1996 година магистрирала на темата „Модификација на повеќеслојни невронски мрежи без повратни врски и нивно изучување“ (магистер по информатички науки), а во 2003-тата ја одбранила докторската дисертација под наслов “Препознавање облици со примена на машините со поддржувачки вектори и повеќеслојните невронски мрежи без повратни врски“ (доктор на информатички науки), на ИИ, ПМФ.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "8",
      "name": "Дејан",
      "surname": "Ѓорѓевиќ",
      "email": "dejan.gjorgjevikj@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_dejan_gjorgjevikj_20727.jpg?itok=BYlq5uSI",
      "description": "Роден е 1967 година во Скопје. Дипломирал, магистрирал и докторирал на Електротехничкиот факултет во Скопје во 1992, 1997 и 2004 година, соодветно. На Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје е вработен во 1992 година како помлад асистент. Во 2004 и 2009 година е избран во звањата доцент и вонреден професор, соодветно, а во 2014 во редовен професор. Одговорен е за 6 предмети на додипломски и четири предмети на магистерски студии. Автор е на преку 70 научни и стручни трудови објавени на домашни и меѓународни конференции и списанија. Учествувал во десетина апликативно истражувачки мултилатерални и билатерални проекти со повеќе универзитети од Европската унија. Член е на IEEE од 1991 и на ACM од 1997 година. Полињата на неговиот научно-истражувачки интерес вклучуваат: препознавање на облици, софтверско инженерство, машинско учење и напредни веб технологии.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "9",
      "name": "Димитар",
      "surname": "Трајанов",
      "email": "dimitar.trajanov@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_dimitar_trajanov_.jpg?itok=cV-McojX",
      "description": "Professor Dimitar Trajanov, Ph.D. is a Head of the Department of Information systems and network technologies at the Faculty of Computer Science and Engineering - ss. Cyril and Methodius University –Skopje. From March 2011 until September 2015, he was the first Dean of the Faculty of Computer Science and Engineering, and in his tenure, the Faculty has become the largest technical Faculty in Macedonia. Dimitar Trajanov is the leader of the Regional Social Innovation Hub established in 2013 as a cooperation between UNDP and the Faculty of Computer Science and Engineering. From 2012 to 2015, he was a member of the National Committee for Innovation and Entrepreneurship where he worked on strategies and legislation to encourage innovation and entrepreneurship in the Republic of Macedonia through inspiring the use of technology for economic development. Dimitar Trajanov is the author of more than 170 journal and conference papers and seven books. He has been involved in more than 70 research and industry projects, of which in more than 50 projects as a project leader. His research interests include Data Science, Machine Learning, NLP, FinTech, Semantic Web, Open Data, Sharing Economy, Social Innovation, e-commerce, Entrepreneurship, Technology for Development, Mobile Development, and Climate Change.",
      "grade": 3.25,
      "votes": 2,
      "reviews": [
        "Najak!",
        "sdfkjsdflkjsdfosdjfas\n"
      ],
      "status": "Д-р "
    },
    {
      "id": "10",
      "name": "Андреа",
      "surname": "Кулаков",
      "email": "andrea.kulakov@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/redoven_profesor_prof.d-r_andrea_kulakov.jpg?itok=YXbKa7bD",
      "description": "Андреа Кулаков заврши гимназија во 1990, на возраст од 16 години, откако успеа на два пати да зема по две школски години во една (7 и 8 одд. и III и IV год. во средно). Потоа се запиша на Електротехнички факултет Скопје и во 1995 година дипломира со највисок просек 9,91 во својата генерација 1990-95. Во 1995 ги почна постдипломските студии по Когнитивни науки на Нов бугарски универзитет во Софија, Бугарија, во мала меѓународна група на студенти со настава на англиски јазик. Студиите ги заврши со одличен успех (5,71 од макс. 6,00). Во јули 1998 ја одбрани својата магистерска теза “Vygovorotsky – An Anticipative and Analogy-making Actor” со одличен успех (5,50), пред пет-члена меѓународна комисија (без менторот). Во 1999 магистерската диплома беше нострифицирана на Електротехнички факултет Скопје.",
      "grade": 4.333333333333333,
      "votes": 3,
      "reviews": [
        "Ahahahhs",
        "asdasdas",
        "asdasdasdasd"
      ],
      "status": "Д-р "
    },
    {
      "id": "11",
      "name": "Љупчо",
      "surname": "Антовски",
      "email": "ljupcho.antovski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_ljupcho_antovski_20719.jpg?itok=TAneVYQj",
      "description": "Роден e 1977 година во Скопје. Основно и средно училиште завршил во Скопје. Учествувал на сојузни и на републички натпревари по физика и информатика. Во 1996 година се запишал на Електротехничкиот факултет во Скопје, каде што бил наградуван за одличен успех во сите учебни години. Дипломирал во 2001 година како првенец на насоката компјутерска техника, информатика и автоматика, со среден успех 9.83, на тема “Софтверски пакет за интелигентно фази-логичко управување на термички процеси”. Постдипломски студии запишал во 2001 година на ИИ при ПМФ. Магистрирал со просек 10,00 во 2003 со одбрана на трудот под наслов “Мобилни плаќања“. Во 2005 година е награден со World Summit Award во категорија e-science. Докторирал во Јануари 2008 со докторска дисертација на тема “Нов модел на мобилни и безжични електронски јавни сервиси”.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "12",
      "name": "Марија",
      "surname": "Михова",
      "email": "marija.mihova@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_marija_mihova_.jpg?itok=SDq6gWDq",
      "description": "Родена 1976 година во Штип. Основно и средно образование завршила во Штип. Добила повеќе награди на натпревари по математика и физика. Дипломирала во 1999 година на студиите по математика на ПМФ, а во 2004 година го одбранила магистерскиот труд на тема “Моделирање надежност на системи со повеќе состојби” и стекнала звање магистер по математички науки. За помлад асистент на ИИ била избрана во 2001 година, а во 2005 година за асистент.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "13",
      "name": "Слободан",
      "surname": "Калајџиски",
      "email": "slobodan.kalajdziski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_slobodan_kalajdzhiski_.jpg?itok=51k7uVA9",
      "description": "Роден е 1976 година во Охрид. Дипломирал и магистрирал на Електротехничкиот факултет во Скопје во 2000 и 2004, соодветно. Докторирал на Факултетот за електротехника и информациски технологии во 2008 година. Првото работно искуство го имал во Неоком А.Д. во 2000 година, каде работел на позициите софтверски архитект, проект менаџер и програмер. На Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје работи од 2000 година како демонстратор. Звањата помлад асистент и асистент ги стекнал во 2003 и 2005 година, соодветно. Во 2008 година бил избран во звањето доцент. Како асистент бил вклучен во одржувањето настава по предмети од областа на програмски јазици, структури и бази на податоци, структурирано програмирање, објектно ориентирано програмирање, објектно ориентирани системи, бази на податоци, објектно ориентирана анализа и дизајн и информациони системи. Како доцент одржува настава по предмети од областа на објектно ориентирани системи, бази на податоци 2, објектно ориентирана анализа и дизајн и информациони системи. Координатор е на магистерските студиски програми Содржинско базирано пребарување и Интелигентни информациони системи, каде одржува настава на дел од предметите покриени со овие студиски програми. Автор е на триесетина научни трудови објавени на меѓународни и домашни конференции и списанија. Учествувал во 8 научно-истражувачки проекти. Полињата на научно-истражувачки интерес вклучуваат биоинформатика, системска биологија, откривање на знаење во податоци, податочно рударење, податочни складишта, бази на податоци, анализа и дизајн на информациони системи.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "14",
      "name": "Невена",
      "surname": "Ацковска",
      "email": "nevena.ackovska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_nevena_ackovska_.jpg?itok=x5fACUCO",
      "description": "Родена e 1975 година во Скопје. Основно и средно училиште завршила во Скопје. Во текот на образованието била добитник на повеќе награди и признанија на регионални и на републички натпревари по биологија и математика. Студиите по компјутерска техника, информатика и автоматика на Електротехничкиот факултет во Скопје ги започнала во учебната 1994/1995 година Академската 1995 година ја следела на Univerity of Massachussetts, Amherst, MA, USA, каде што била на листата на најдобрите студенти. Дипломирала во 2000 година на Електротехничкиот факултет во Скопје со среден успех 9,52.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "15",
      "name": "Горан",
      "surname": "Велинов",
      "email": "goran.velinov@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_goran_velinov_20726.jpg?itok=RFHHuruG",
      "description": "Горан Велинов ја одбранил својата докторска дисертација од областа на Информатички науки во 2008 година (под наслов „Обопштување и подобрување на оптимизациските процеси кај релационите податочни складови“) на Природно – математичкиот факултет на Универзитетот Св. Кирил и Методиј во Скопје. Во 2009 година е избран во насловен доцент на Природно – математичкиот факултет во Скопје, додека во 2010 е избран во доцент на Факултетот за информатички науки и компјутерско инженерство (ФИНКИ), каде што предава Напредни бази на податоци. Тој има објавено бројни трудови во списанија и меѓународни конференции, главно во областа на складови на податоци и оптимизација. Тој има учествувано во неколку меѓународни проекти, како што се ELISA, INTERREG IIIB CADSES, 2006-2008; SEE-GRID, 6FP IST проект, 2004-2006; SEE-GRID2, 7FP IST проект, 2006-2008 и др. Неговите истражувачки интереси се насочени кон дизајн и имплементација на складови на податоци, моделирање на податоци, особено повеќедимензионално моделирање, како и бизнис интелигентни системи.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "16",
      "name": "Анастас",
      "surname": "Мишев",
      "email": "anastas.mishev@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_anastas_mishev_20720.jpg?itok=iWfnzL7s",
      "description": "Роден e 1971 година во Охрид. Основно и средно училиште завршил во Охрид. Во 1990 година се запишал на Военотехничкиот факултет во Загреб, каде што ја завршил првата година на студиите. Од академската 1991/92 година студиите ги продолжил во Скопје, на ИИ при ПМФ. Студиите ги завршил во 1996 година, со што се стекнал со звањето дипломиран инженер по информатика.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "17",
      "name": "Соња",
      "surname": "Филипоска",
      "email": "sonja.filiposka@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_sonja_filiposka_.jpg?itok=YWENSJ6L",
      "description": "Родена е 1980 година во Скопје. Дипломирала на Електротехничкиот факултет во Скопје во 2003 година. Магистрирала и докторирала на Факултетот за електротехника и информациски технологии во Скопје во 2007 и 2009 година, соодветно. Со работа на Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје почнала веднаш по дипломирањето во 2003 година со звање како помлад асистент. Во 2007 година е избрана во звањето асистент, а во 2009 за доцент. Има објавено над триесетина научни трудови. Автор е и на повеќе книги наменети за едукација во полето на користење апликативни програми. Има учествувано во повеќе домашни и меѓународни научни и апликативни проекти. Области на нејзин научно-истражувачки интерес се безжични мобилни ад хок мрежи, комплексни мрежи, компјутерски мрежи, апликативен софтвер, електромагнетна компатибилност.",
      "grade": 5,
      "votes": 1,
      "reviews": [
        "Najdobra"
      ],
      "status": "Д-р "
    },
    {
      "id": "18",
      "name": "Иван",
      "surname": "Чорбев",
      "email": "ivan.chorbev@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_ivan_chorbev_-_dekan_.jpg?itok=ih0cOw21",
      "description": "Роден е 1980 година во Охрид. Дипломирал и магистрирал на Електротехничкиот факултет во Скопје во 2004 и 2006 година, соодветно. Докторирал на Факултетот за електротехника и информациски технологии во Скопје во 2009 година. Во текот на факултетското образование бил континуирано наградуван за успешните студии. Како најдобар студент во генерацијата е наградуван од Факултетот, универзитетот “Св. Кирил и Методиј” и други организации и фондации, меѓу кои Организацијата на инженерите на Македонија, од која ја добил наградата златен прстен.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "19",
      "name": "Ласко",
      "surname": "Баснарков",
      "email": "lasko.basnarkov@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._lasko_basnarkov_.jpg?itok=3fueo1Yh",
      "description": "Ласко Баснарков е роден во Кавадарци, во 1977 година. Димпломира на Електротехничкиот факултет во Скопје во 2000 година, на насоката електроника и телекомуникации. Магистрира во 2005, а докторира во 2009 година на Природно-математичкиот факултет во Скопје, во областа теориска физика. Работи како асистент по физика на Електротехничкиот факултет (подоцна Факултет за електротехника и информациски технологии) од 2002 година. Од септември 2011 година е вработен на Факултетот за информатички науки и компјутерско инженерство, како доцент по физика.Централно место во научниот интерес на Ласко Баснарков завземаат нелинеарната динамика и статистичката физика. Подетално се занимавал со проучување на детерминистичка и стохастичка дифузија и синхронизација на фазни осцилатори. Денес неговите истражувања се насочени кон употребата на синхронизацијата за моделирање на климата и моделирање на финансиски временски серии. Главни алатки кои ги користи во своите истражувања се математичка анализа и компјутерски симулации.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "20",
      "name": "Боро",
      "surname": "Јакимовски",
      "email": "boro.jakimovski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof_d-r_boro_jakimovski_-_prodekan_za_nauka_i_sorabotka20718.jpg?itok=SBKf2A57",
      "description": "Роден на 1 март 1978 година во Скопје, каде што ги завршил основното и средното образование со одличен успех. Во текот на школувањето учествувал и освојувал награди на повеќе натпревари, меѓу кои на Државниот натпревар по информатика за средношколци во 1996 година освоил I награда, а учествувал на 8. Интернационална олимпијада по информатика и на 4. Балканска олимпијада по информатика, како претставник од Р. Македонија. При завршувањето на средното училиште бил прогласен за првенец на генерацијата. Истовремено, со успех ги завршил курсевите по англиски јазик во Центарот за странски јазици во Скопје и се стекнал со диплома од Универзитетот во Кембриџ за положен прв сертификат по англиски јазик. На студиите по информатика на ПМФ се запишал во академската 1996/97 година Дипломирал во 2000 година како најдобар студент на Факултетот и на Универзитетот, со среден успех 9.91. Во текот на студиите добил многубројни признанија за учество на меѓународни студентски натпревари за програмирање.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "21",
      "name": "Весна",
      "surname": "Димитрова",
      "email": "vesna.dimitrova@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof_dr_vesna_dimitrova_-_prodekan_za_finansii_20717.jpg?itok=n0ccuufz",
      "description": "Роденa е 1974 година во Скопје. Основното и средното образование го завршила во Скопје, со континуиран одличен успех. На студиите по информатика на Институтот за Информатика при ПМФ, применета насока дипломирала во јуни 1997 со дипломска работа од областа криптографијата под наслов “Софтверска реализација на безбедна комуникација со C модули под UNIX” под менторство на проф. д-р Смиле Марковски, редовен професор на ПМФ. Во текот на школувањето примала стипендија за талентирани ученици и студенти. Во мај 2005 година јавно го одбранила нејзиниот магистерски труд под наслов „Квазигрупни трансформации и нивни примени“ под менторство на проф. д-р Смиле Марковски, а во ноември 2010 јавно ја одбранила и нејзината докторска теза под наслов “Квазигрупно процесирани низи, нивна Булова презентација и примена во криптогафијата и теоријата на кодирање” исто така под менторство на проф. д-р Смиле Марковски и се здобила со звањето доктор на информатички науки.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "22",
      "name": "Гоце",
      "surname": "Арменски",
      "email": "goce.armenski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_goce_armenski.jpg?itok=tZw9_KMY",
      "description": "Роден е 1976 година во Скопје. Основно и средно образование оформил во Скопје и бил добитник на повеќе награди и признанија на републички и на сојузни натпревари по математика и физика. Во 1995 година се запишал на Електротехничкиот факултет во Скопје, отсек компјутерска техника, информатика и автоматика. Во текот на студиите 5 пати бил наградуван за одличен успех во студирањето. Дипломирал во 2000 година,со одбрана на дипломската работа под наслов “Публикување преку WEB“ со среден успех 9,36. Постдипломски студии по информатика запишал на ПМФ во Скопје. Магистерскиот труд со наслов “Електронско тестирање”, изработен под менторство на проф. д-р Марјан Гушев, го одбранил во 2003 година По дипломирањето бил избран за помлад асистент на ИИ, а по магистрирањето, во 2004 година, за асистент. Докторира во 2010 година со докторската дисертација со наслов „Сервис-ориентирана архитектура во е-тестирање“ и во истата година е избран за доцент.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "23",
      "name": "Соња",
      "surname": "Гиевска",
      "email": "sonja.gievska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/d-r._sonja_gievska.jpg?itok=x0JJECl7",
      "description": "Родена е 1963 година во Скопје. Дипломирала на Електротехничкиот факултет во Скопје (1986), магистрирала на Електротехничкиот факултет во Загреб (1993) и докторирала на универзитетот „Џорџ Вашингтон“, САД (2004). Во 1990 година е вработена на Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје како помлад асистент. Звањата асистент и доцент ги стекнала во 1993 и 2005 година, соодветно. За време на докторските студии во САД (1997-2003) и во периодот од 2006 до денес, предавала и учествувала во истражувачката дејност на универзитетот „Џорџ Вашингтон“, САД. Нејзината научно-истражувачката работа е од областа на кориснички интерфејси со посебен интерес за интелигентни интерфејси базирани на агенти, репрезентација на контекст во интелигентни системи и мултимедиски системи. Автор/коавтор е на околу четириесетина научни трудови публикувани во зборници од меѓународни конференции, едитирани книги и меѓу народни научни списанија. Учествувала во десетина научно-истражувачки проекти во Македонија и САД. Нејзините актуелни истражувања се фокусирани на интелигентни системи за поддршка на интеракцијата човек-компјутер, посебно наменети за системи во кои сигурноста и безбедноста на корисниците и опремата се од критична важност.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "24",
      "name": "Дејан",
      "surname": "Спасов",
      "email": "dejan.spasov@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_dejan_spasov_.jpg?itok=o14tryuz",
      "description": "Роден е 1976 година во Скопје. Во 2003-та година дипломира на Електротехничкиот факултет во Скопје. Магистерските студии ги продолжува на Бостон Универзитетот во Бостон, Масачусетс. Магистерската работа „Имплементирање на Лексикографската конструкција“ ја одбранил во 2006-та година. Во 2008-ма година е вработен како помлад асистент на Институтот за Информатика при Природно-математичкиот факултет. Во 2010 ја одбранил докторската дисертација „Прилог кон некои особини на добрите кодови“ на Природно-математичкиот факултет во Скопје. Има остварено два студиски престои: во 2001-ва година на Институтот за Нелинеарни науки, при Универзитетот во Калифоринја во Сан Диего и во 2010 година во Опатија, Р. Хрватска на NATO институтот за напредни студии. Научен интерес на д-р Дејан Спасов се теорија за кодирање и компјутерски мрежи. Во досегашната научно-истражувачка работа има учествувано на 6 конференции во земјата и странство, при што има објавено 8 научни труда и една статија во меѓународно научно списание. Има учествувано на три меѓународни проекти.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "25",
      "name": "Ивица",
      "surname": "Димитровски",
      "email": "ivica.dimitrovski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_ivica_dimitrovski.jpg?itok=NSPdlf0q",
      "description": "Роден е 1981 година во Кратово. Дипломирал на Електротехничкиот факултет во Скопје во 2005 година. Магистрирал на Факултетот за електротехника и информациски технологии во Скопје во 2008 година. На Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје почнал да работи од 2005 година прво како демонстратор, во 2007 година e избран во звањето помлад асистент, a во 2009 во асистент. Неговите наставни обврски опфаќаат изведување вежби по предмети од областа на структурирано програмирање, објектно ориентирано програмирање, интернет програмирање, кориснички интерфејси, визуелизација и виртуелна реалност.Во рамките на досегашната научно-истражувачка работа учествувал во изработката на повеќе публикувани научно-истражувачки трудови и три поглавја во книги. Полињата на научно-истражувачки интерес вклучуваат обработка на слики и видео, извлекување на визуелни карактеристики за сликите, содржинско базирано пребарување на мултимедијални податоци, машинско учење.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "26",
      "name": "Игор",
      "surname": "Мишковски",
      "email": "igor.mishkovski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_igor_mishkovski_.jpg?itok=1ltbNOOb",
      "description": "Роден е 1981 година во Скопје. Дипломирал на Електротехничкиот факултет во Скопје во 2005 година. Магистрирал на Факултетот за електротехника и информациски технологии во 2008 година. Во моментов работи на докторската теза од областа на ранливост на комплексни мрежи. Веднаш по дипломирањето започнал со работа на Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје како демонстратор. Од крајот на 2007 година работи како помлад асистент по предметите од областа компјутерска техника и информатика. Во текот на неговиот работен ангажман дава значаен придонес во осмислувањето, креирањето и организацијата на аудиториски и лабораториски вежби. Активно учествувал во истражувања од областа на комплексните и компјутерските мрежи и има објавено 10 научни трудови на меѓународни и домашни конференции и списанија. Учествувал во изработката на 4 книги, како и во поголем број на научно истражувачки и апликативни проекти. Области на негов научно-истражувачки интерес се комплексни мрежи, компјутерски мрежи, безжични мобилни ад хок мрежи, апликативен софтвер и веб технологии, дизајнирање на системи на чип.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "27",
      "name": "Ѓорѓи",
      "surname": "Маџаров",
      "email": "gjorgji.madjarov@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_gjorgji_madzharov_20725.jpg?itok=4VvXDAwu",
      "description": "Роден е 1984 година во Велес. Дипломирал на Факултетот за електротехника и информациски технологии во Скопје во 2007 година, на насоката компјутерска техника, информатика и автоматика со просек 10.00, како најдобар во својата генерација. Добитник е на наградата „Златник“ од Универзитетот „Свети Кирил и Методиј“ и „Златен прстен“ од организацијата на инженерите на Македонија. Во 2009-та година ја одбранил магистерската тема и се стекнал со научното звање магистер на електротехнички науки област компјутерска техника и информатика. Докторската дисертација ја одбранил во 2012-та година под менторство на проф. Дејан Ѓорѓевиќ и коменторство на проф. Сашо Џероски на Факултетот за информатички науки и компјутерско инженерство. Своето прво работно искуство го стекнал во Друштвото за компјутерски услуги „Netcetera“ - Скопје, во одделот за софтвер и веб развој. Во рамките на досегашната научно-истражувачка работа, учествувал во изработката на повеќе научни и стручни трудови објавени на домашни и меѓународни конференции и списанија. Полињата на неговиот научно-истражувачки интерес вклучуваат: препознавање на облици, машинско учење и софтверско инженерство.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "28",
      "name": "Смилка",
      "surname": "Јанеска Саркањац",
      "email": "smilka.janeska.sarkanjac@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/von._prof._d-r_smilka_janeska_sarkanjac_20686.jpg?itok=rQ962-8-",
      "description": "Родена е 1968 година во Прилеп. Во 1992 год. завршила Електро-технички факултет на Универзитетот “Св. Кирил и Методиј” во Скопје, насока Компјутерска техника и автоматика. Во 2005 година се запишува на последипломски студии на Економскиот факултет на Универзитетот “Св. Кирил и Методиј” во Скопје, на насоката МБА менаџмент, и магистрира во 2009 година со темата „Информационата технологија во стратегијата на претпријатието“. Во јуни 2011 година на Економскиот факултет на Универзитетот “Св. Кирил и Методиј” во Скопје ја одбранила докторската дисертација под наслов „Стратегиски модели на е-Управување“. Во 2009 година е избрана за асистент на Универзитетот Американ колеџ во Скопје, на Факултетот за деловна економија и организациони науки, а во 2011 година е избрана за асистент на Факултетот за информатички науки и компјутерско инженерство на Универзитетот “Св. Кирил и Методиј” во Скопје.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "29",
      "name": "Вангел",
      "surname": "Ајановски",
      "email": "vangel.ajanovski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/vangel-ajanovski.jpg?itok=o_XvcoEr",
      "description": "Роден е 1975 година во Скопје. Основно и средно насочено училиште завршил во Скопје со звање информатички техничар. Добитник е на неколку награди на државните натпревари за средношколци по информатика, математика и физика. Во 1993 година се запишал на студии по информатика на Природно-математичкиот факултет во Скопје, кои ги завршил во 1999 година како најдобар дипломиран студент на ИИ и се стекнал со звањето дипломиран инженер по информатика. По повод 50-годишниот јубилеј на Универзитетот, во 2000 година, е добитник на награда за трудот „Систем на пријавување испити преку Интернет“, како најдобар проект од областа на информатиката. Истата година бил избран за стручен соработник, во 2002 за помлад асистент, во 2007 за асистент на која позиција премина на ФИНКИ во 2011 година. Во 2013 година е избран за доцент на ФИНКИ.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "30",
      "name": "Весна",
      "surname": "Димитриевска Ристовска",
      "email": "vesna.dimitrievska.ristovska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_vesna_dimitrievska_ristovska_20723.jpg?itok=OsFJ8hPO",
      "description": "д-р Весна Димитриевска Ристовска е родена 1968 год. во Скопје. Основно и средно образование завршила во Скопје, со континуиран одличен успех. Дипломирала на Природно-математичкиот Факултет во Скопје на студиите по информатика со просечна оценка на студиите 9.43, со одбрана на дипломска работа со наслов “Паралелизација на секвенцијална програма“. Во јануари 2007 година го одбранила магистерскиот труд под наслов “Квантитативни мерки за рамномерна распределба на низи“, со што се здобила со звањето магистер по информатички науки. Во 2013 година на ФИНКИ ја одбранила докторската дисертација на тема ,,Квази Монте карло интегрирање во тежински Хилбертови простори и врска со дијафонијата – математички модели и софтверска реализација”.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "31",
      "name": "Миле",
      "surname": "Јованов",
      "email": "mile.jovanov@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._dr-_mile_jovanov_.jpg?itok=Ery8CAmL",
      "description": "Миле Јованов е роден 1980 година во Кавадарци, каде завршил основно и средно образование како најдобар ученик во генерацијата. Дипломирал на Институтот за информатика при Природно-математичкиот факултет (ПМФ) во Скопје во 2002 година, како најдобар студент на факултетот. Магистрира на ПМФ во 2009, а докторира на ФИНКИ во 2013. По дипломирањето бил назначен за демонстратор на Институтот. Од 2005 година е вработен како помлад асистент/асистент на ПМФ, при формирањето се префрла на ФИНКИ, каде е избран во звањето доцент во 2014, вонреден професор во 2018 година и редовен професор во 2023. На ФИНКИ бил Раководител на Институтот за Интелигентни системи. Изведувал настава на дваесетина предмети на додипломските, магистерските и докторските студии. Ментор е на два докторанти и на повеќе дипломски работи, а автор е на петнаесетина учебници/прирачници.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "32",
      "name": "Билјана",
      "surname": "Стојкоска",
      "email": "biljana.stojkoska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/von._prof._d-r_biljana_risteska_stojkoska_20683.jpg?itok=z-a8ezme",
      "description": "Родена во 1982 година во Охрид. Дипломирала и магистрирала на Факултетот за електротехника и информациски технологии во Скопје во 2006 и 2008 година, соодветно. Во моментов работи на докторската теза. На Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје почнала да работи од 2005 год. како демонстратор. Во 2009 година е избрана за помлад асистент. Одговорна е за изведување вежби по предмети од областа на алгоритми и структури на податоци, дистрибуирани компјутерски системи, експертни системи, мобилни информациони системи, проектирање на вградливи компјутерски компоненти и информациони системи. Во рамките на досегашната научно-истражувачка работа објавила повеќе трудови во зборници од конференции и во меѓународни научни списанија.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "33",
      "name": "Кире",
      "surname": "Триводалиев",
      "email": "kire.trivodaliev@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/trivodaliev.jpg?itok=RwUg3pLK",
      "description": "Роден е 1982 година во Струмица. Дипломирал на Електротехничкиот факултет во Скопје во 2006 година. Магистрирал на Факултетот за електротехника и информациски технологии во Скопје во 2008 година. Во текот на образованието редовно е наградуван за успешно студирање, а како најдобар студент во генерацијата е награден и од универзитетот „Св. Кирил и Методиј“ и други организации и фондации, меѓу кои Организацијата на инженерите на Македонија, која го наградила со наградата златен инженерски прстен. На Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје работи од 2005 година како демонстратор. Во 2007 година го стекнал звањето помлад асистент, а во 2010 година звањето асистент. Во своите наставни обврски бил/е одговорен за изведување вежби по предмети од областа на бази на податоци, вештачка интелигенција, податочно рударење, алгоритми за анализа на податоци, логичко и функционално програмирање и биокибернетика. Како автор/коавтор има учествувано во изработката на повеќе од 15 трудови публикувани во реномирани меѓународни научни списанија и зборници од конференции. Неговиот научно-истражувачки интерес е фокусиран на областите: биоинформатика, пресметковна биологија, вештачка интелигенција, податочно рударење, алгоритми за анализа на податоци и бази на податоци.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "34",
      "name": "Сашо",
      "surname": "Граматиков",
      "email": "sasho.gramatikov@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/von._prof._d-r_sasho_gramatikov_20687.jpg?itok=zJkLMmC4",
      "description": "Роден е 1982 година во Скопје. Дипломирал на Факултетот за електротехника и информациски технологии  во Скопје во 2005 година. Магистрирал на истиот факлутет во 2009 година. Истата година запишува докторски студии на Tехничкиот универзитет на Мадрид (UPM). По одбраната на докротрската дисертација со оценка Cum Laude, во декември 2013, се стекнува со титулата интернационален доктор по телекомуникации.Својата академска кариера ја започнува во 2006 на Институтот за компјутерска техника и информатика при Електротехничкиот факултет во Скопје. Во текот на својот работен ангажман дал значаен придонес во осмислување, креирање и организација на аудиториски и лабораториски вежби по наставните предмети во чие изведување учествува. Учествувал во поголем број научно истражувачки и апликативни проекти. Област на негов научен интерес се компјутерските мрежи и дистрибуција на мултимедијални содржини. Постигнатите резултати ги објавува како научни трудови на бројни меѓународни и домашни конференции.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "35",
      "name": "Мирослав",
      "surname": "Мирчев",
      "email": "miroslav.mirchev@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/vonred_profesor_miroslav_mirchev_20689.jpg?itok=-EvIc9OX",
      "description": "Во 2014 година е избран за доцент на Факултетот за информатички науки и компјутерско инженерство во Скопје, а во 2019 и за вонреден професор на истиот факултет. Негови полиња на научно-истражувачка работа се мрежна наука, комплексни системи, машинско учење, вештачка интелигенција, компјутерски мрежи, оптички мрежи, итн. Досега има објавено голем број на научно-истражувачки трудови во реномирани меѓународни списанија и конференции и има учествувано во повеќе меѓународни и национални научно-истражувачки проекти, како и во неколку стручно-апликативни проекти. Бил член во програмски одбор на повеќе меѓународни конференции, и претседавач на една меѓународна конференција.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "36",
      "name": "Георгина",
      "surname": "Мирчева",
      "email": "georgina.mirceva@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/von._prof._d-r_georgina_mircheva_20684.jpg?itok=VbK_QaTE",
      "description": "Родена е 1984 година во Свети Николе. Дипломирала и магистрирала на Факултетот за електротехника и информациски технологии во Скопје во 2007 и 2009 година, соодветно. Во текот на факултетското образование редовно била наградувана за успешните студии. Во 2014 година докторирала на Факултетот за информатички науки и компјутерско инженерство во Скопје.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "37",
      "name": "Магдалена",
      "surname": "Костоска",
      "email": "magdalena.kostoska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/von._prof_d-r_magdalena_kostoska_gjorchevska_20678.jpg?itok=aDfJYVk8",
      "description": "Родена е 1982 година во Гостивар.Основно училиште завршила во ОУ„Братство-Единство“, Гостивар, а средно училиште во „Раде Јовчевски – Корчагин-ПЕКСНАС“ во Скопје, како ученик на генерација. Дипломирала на Природно-математички факултет на Институт за Информатика во Скопје 2006 година, со дипломска работа на тема „ Веб апликација за on-line пријавување на проекти “ под менторство на проф. Д-р Марјан Гушев, притоа завршувајќи ги своите студии со просек 9,7. 2007 година се запишува на последипломските студии на Природно-Математичкоти Факултет, на насоката Софтверско Инженерство. За време на студиите (од 2001 година до 2005 година) добила признанија и пофалби за натпросечно остварување во првата, втората, третата и четвртата студиска година од факултетското образование.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "38",
      "name": "Александра",
      "surname": "Поповска Митровиќ",
      "email": "aleksandra.popovska.mitrovikj@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/von._prof._d-r_aleksandra_popovska_-_mitrovikj20681.jpg?itok=ZOSyKvo1",
      "description": "Родена е 1979 година во Скопје. Основно и средно училиште завршила во Скопје. Студии по информатика на ПМФ запишала во академската 1998/99 година. Дипломирала во 2003 година како најдобар студент на ПМФ со среден успех 9.16, и добила пофалница од Универзитетот “Св. Кирил и Методиј” во Скопје. Во 2009 година магистрирала на Институтот за информатика со магистерски труд под наслов “Споредба на перформансите на случајни кодови базирани на квазигрупи и кодовите на Рид-Милер и Рид-Соломон“,. Демонстратор на ИИ била од октомври 2002 година, а од септември 2006 година е помлад асистент.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "39",
      "name": "Наташа",
      "surname": "Илиевска",
      "email": "natasa.ilievska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/von_prof_d-r_natasha_ilievska_20677.jpg?itok=K8BUotHf",
      "description": "Родена е 1978 година. Основно и средно образование завршила во Скопје со одличен успех. На Природно-математичкиот факултет во Скопје на Институтот по информатика, применета насока, се запишала во академската 1996/97 година. Дипломирала во 2001 година, со среден успех 9.94, како најдобар дипломиран студент во генерација на Институтот за информатика, стекнувајќи се со звање дипломиран инженер по информатика. На постдипломски студии по математика се запишала во академската 2002/2003 година, а ги завршила во 2009 со одбрана на магистерскиот труд “Кодови за откривање грешки и примена на квазигрупи за нивно дизајнирање”. Докторската дисертација од областа на теоријата на кодирање ја одбранила во 2015 на Факултетот за информатички науки и компјутерско инженерство - ФИНКИ.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "40",
      "name": "Билјана",
      "surname": "Тојтовска",
      "email": "biljana.tojtovska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/von._prof._d-r_biljana_tojtovska_ribarski_20680.jpg?itok=XOKNzXu4",
      "description": "Родена е 1980 година во Скопје. Основно и средно училиште завршила во Скопје. Била член на Македонскиот тим на Меѓународните математички олимпијади за средношколци. Учествувала на повеќе Балканијади и Светски олимпијади на кои освоила пофалници и два бронзени медали. Во 1999 се запишала на студиите по теориска математика на Природно математичкиот факултет во Скопје. Дипломирала во 2004 со просек 9.88. Како стипендист на DAAD продолжила на Магистерски студии по Стохастика и финансиска математика на Техничкиот Универзитет Кајзерслаутерн во Германија. Во 2007 година под менторство на проф. Ralf Korn ја комплетирала магистерската теза под наслов “Martingale decompositions with application in Finance” за која добила оценка 10. Студиите ги завршила со просек 10 и за резултатите постигнати за време на магистерските студии добила признание за најдобар студент на институтот по Математика. За време на својот престој во Германија работела и на проектот “ Asset liability managment” во рамките на институтот ITWM Fraunhofer.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "41",
      "name": "Милош",
      "surname": "Јовановиќ",
      "email": "milos.jovanovik@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/von._prof._d-r_milosh_jovanovikj20685.jpg?itok=Djw0g3Tf",
      "description": "Роден е 1985 година во Куманово. Дипломирал на Факултетот за електротехника и информациски технологии во Скопје во 2008 година на насоката Информатика и компјутерско инженерство. Магистрирал на истиот факултет во 2010 година на насоката Компјутерски мрежи и е-технологии, со магистерска теза од областа на семантички веб технологии. Во 2016 година докторирал на Факултетот за информатички науки и компјутерско инженерство, на насоката Компјутерски науки и инженерство, со докторска дисертација од областа на поврзани податоци. Во текот на студирањето континуирано е наградуван за успешно студирање.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "42",
      "name": "Андреја",
      "surname": "Наумоски",
      "email": "andreja.naumoski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/von._prof._d-r_andreja_naumoski_20682.jpg?itok=v8zSqQYN",
      "description": "д-р Андреја Наумоски дипломирал и магистрирал  во 2006 и 2008 година, соодветно,додека во јули 2012 успешно ја одбранил докторската теза на Факултетот за информатички науки и компјутерско инженерство во Скопје. Од 2006 година, работи на неколку меѓународни проекти на Факултетот како истражувачки асистент, додека во 2009 година е ангажиран како демонстратор при Факултетот за електротехника и информациски технологии во Скопје. На Факултетот за информатички науки и компјутерско инженерство во Скопје во 2011 година е ангажиран како демонстратор, додека во јануари 2014 е избран во звањето насловен доцент. Наставните обврски му опфаќаат изведување предавања и аудиториски вежби по неколку предмети. Автор и коавтор е на повеќе од четириеесет научни трудови на меѓународни  конференции и престижни странски списанија, како и меѓународни списанија со фактор на влијание. Учествувал во 3 меѓународни проекти финансирани од Темпус и FP6 програмата, како и на билатерални проекти. Полиња на научно - истражувачки интерес му се машинско учење и податочно рударење на еколошки податоци, моделирање и предикција на динамички процеси, фази логика и фази машински алгоритми, како и анализа на временски серии.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "43",
      "name": "Панче",
      "surname": "Рибарски",
      "email": "pance.ribarski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/doc._d-r_panche_ribarski_20700.jpg?itok=d85pE6O_",
      "description": "Роден е 1984 година во Штип. Основно училиште до четврто одделение завршил во Радовиш, а потоа основно и средно во Скопје. Во 2003 година се запишал на студии по информатика на Природно математички факултет во Скопје, кои ги завршил во 2008 година. Во последните две години од студирањето бил примен како демонстратор на Институтот за информатика. Во 2008 година бил избран како асистент на Факултетот за информациски технологии МИТ во Скопје. Во 2009 година бил избран како соработник на Институт за информатика при Природно математички факултет во Скопје. Во рамките на наставниот процес на институтот учествува како соработник во изведувањето на наставата во следните предмети: Структури на податоци, Мрежни оперативни системи, Безбедност и криптографија, Безжични и мобилни технологии, Управување на софтверски проекти, Дизајн и архитектура на софтвер, Оперативни системи и Анализа на софтверски потреби.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "44",
      "name": "Христина",
      "surname": "Михајлоска",
      "email": "hristina.mihajloska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/doc._d-r_hristina_mihajloska_trpcheska_20704.jpg?itok=7-AHBQPf",
      "description": "Христина Михајлоска е родена 1985 година во Охрид, Македонија. Дипломирала на Природно-математички Факултет, Институт за Информатика во Скопје, во 2008 година. Во 2011 година се здобила со титулата магистер по информатички науки при Факултетот за Информатички науки и компјутерско инженерство (ФИНКИ) во Скопје на насоката ТЕМПУС - Софтверско инженерство. Нејзината магистерска тема е од областа на симетричната криптографија и е со наслов “Анализа и конструкција на оптимални супституциски табели кај блок шифрувачи со помош на квазигрупи” под менторство на Данило Глигороски, редовен професор на Норвешкиот универзитет за наука и технологии (NTNU) во Трондхејм, Норвешка. Во март 2017 година, докторирала на Факултетот за Информатички науки и компјутерско инженерство (ФИНКИ) во Скопје, со докторска дисертација од областа на криптографијата под наслов “Лесна криптографија од перспектива на теоријата на квазигрупи” под менторство на проф. Глигороски.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "45",
      "name": "Иван",
      "surname": "Китановски",
      "email": "ivan.kitanovski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/doc._ivan_kitanovski_20703.jpg?itok=bE-ijIDJ",
      "description": "Роден е 1986 година во Битола. Дипломирал на Факултетот за електротехника и информациски технологии во Скопје во 2009 год. Во моментов е запишан на магистерски студии на истиот факултет. Во текот на факултетското образование бил континуирано наградуван за успешното студирање. Своето прво работно искуство го стекнал во “T-Mobile” во 2008, каде работел како програмер. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје почнал да работи од 2009 година како демонстратор. Во моментов е одговорен за изведување на аудиториските и лабораториските вежби по предметите од областа на интернет програмирање и визуелизација. Области на неговиот научно-истражувачки интерес се обработка на слики, податочно рударење, машинско учење, софтверско инженерство.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "46",
      "name": "Ефтим",
      "surname": "Здравевски",
      "email": "eftim.zdravevski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/doc._d-r_eftim_zdravevski_20694.jpg?itok=eOTDBg6-",
      "description": "Роден е 1984 година во Радовиш. Дипломирал на Факултетот за електротехника и информациски технологии во Скопје во 2008 година. Магистрирал на истиот факултет на насоката Интелигентни информациони системи во 2010 година, со магистерска теза од областа на податочно рударење. Во текот на студирањето континуирано е наградуван за успешно студирање. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје работи од 2010 година како демонстратор. Неговите наставни обврски вклучуваат подготовка и изведување на аудиториски и лабораториски вежби по предмети од областа на дистрибуирани компјутерски системи, алгоритми за анализа на податоци и интелигентни информациони системи, додека неоговото практичното искуство се состои од дизајн и имплементација на разновидни софтверски решенија стекнати при работењето во НИ ТЕКНА – Интелигентни технологии.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "47",
      "name": "Петре",
      "surname": "Ламески",
      "email": "petre.lameski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_petre_lameski_-_prodekan_za_nastava_.jpg?itok=6kA_2g5D",
      "description": "Роден е 1985 година во Кавадарци. Во 2008 година дипломирал на Факултетот за електротехника и информациски технологии во Скопје. Магистрирал на истиот факултет во 2010 година, со магистерска теза од областа на роботиката. Во текот на студирањето бил редовно на градуван за успешните студии. Од 2008 година работи на Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје како демонстратор. Неговите наставни обврски опфаќаат изведување вежби по предмети од областа на роботика, дистрибуирани компјутерски системи, вештачка интелигенција, алгоритми за анализа на податоци, информациони системи и мобилни информациони системи. Области од научно-истражувачки интерес му се машинска интелигенција и учење, интелигентни мобилни роботи, анализа на временски серии на податоци и когнитивни системи.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "48",
      "name": "Катарина",
      "surname": "Тројачанец Динева",
      "email": "katarina.trojacanec@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/doc._d-r_katarina_trojachanec_dineva_20698.jpg?itok=-AYoznZm",
      "description": "Родена е 1986 година во Куманово. Дипломирала на Факултетот за електротехника и информациски технологии во Скопје во 2008 год. Магистрирала на истиот факултет во 2010 година, со магистерска теза од областа на содржински базирано пребарување на слики од магнетна резонанца. Во текот на факултетското образование била континуирано наградувана за успешното студирање. Како најдобар студент од генерацијата е наградувана од Факултетот, универзитетот “Св. Кирил и Методиј”, како и други фондации и е добитник на инженерски прстен од Организацијата на инженерите на Македонија. Таа своето прво работно искуство го стекнала на Европскиот универзитет на Факултетот за информатика во 2008 година. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје почнала да работи во 2008 година како демонстратор. Во моментот е одговорна за изведување на аудиториските и лабораториските вежби по предмети од областа на структурирано програмирање, објектно-ориентирано програмирање, интернет програмирање и кориснички интерфејси. Области на нејзин научно-истражувачки интерес се обработка на слики, податочно рударење, машинско учење, софтверско инженерство.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "49",
      "name": "Владимир",
      "surname": "Здравески",
      "email": "vladimir.zdraveski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/von._prof._vladimir_zdraveski20679.jpg?itok=yMAEenLr",
      "description": "Роден е 1988 година во Прилеп. Дипломирал на Факултетот за електротехника и информациски технологии во Скопје во 2010 година. Во текот на студирањето континуирано е наградуван за успешно студирање. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје работи од 2010 година како демонстратор. Неговите наставни обврски опфаќаат подготовка и изведување на аудиториски и лабораториски вежби за предмети од областа на компјутерски мрежи, мрежни оперативни системи, WAN компјутерски мрежи и безжични компјутерски мрежи. Учествувал во неколку меѓународни проекти. Во рамките на досегашната научно-истражувачка работа има објавено два научни трудови и коавтор е на една книга. Негови активни полиња на научен интерес се: дизајн на дигитални системи со HDL, семантичкиот веб, веб базирани системи, системски софтвер и компјутерски мрежи.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "50",
      "name": "Бојана",
      "surname": "Котеска",
      "email": "bojana.koteska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/doc._d-r_bojana_koteska_20696.jpg?itok=gZpqnViJ",
      "description": "Родена е во 1988 година во Куманово. Додипломските студии ги започнала на ПМФ на Институтот за информатика, а дипломирала на Факултетот за информатички науки и компјутерско инженерство (ФИНКИ) во Скопје во 2011 година на насоката софтверско инженерство со просечен успех 9.87, како најдобар студент во својата генерација. Добитник е на наградата „Златник“ од Универзитетот „Св. Кирил и Методиј“ и „Златен прстен“ од организацијата на инженерите на Македонија. Во 2012 година ја одбранила магистерската тема и се стекнала со научното звање магистер по информатички науки од областа на софтверското инженерство. Докторската дисертација ја одбранила во 2018 година под менторство на проф. Анастас Мишев на Факултетот за информатички науки и компјутерско инженерство.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "51",
      "name": "Моника",
      "surname": "Симјаноска",
      "email": "monika.simjanoska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/doc._d-r_monika_simjanoska_20699.jpg?itok=N5wnzHWT",
      "description": "Родена е во 1988 година во Загреб, Р. Хрватска. Дипломирала во 2012 година на Институтот за информатика при Природно-математичкиот факултет во Скопје, по што истата година се запишала на магистерски студии на Факултетот за информатички науки и компјутерско инженерство во Скопје на насоката интелигентни системи. Магистерската теза со наслов „Бајесова класификација на генска експресија кај колоректален канцер добиена со технологија на ДНК микрополиња имплементирана како SaaS во Облак “ ја одбранила во 2013 година и се стекнала со звањето магистер по информатички науки и компјутерско инженерство од областа интелигентни системи.На докторски студии се запишала во септември 2014 и во 2019 година ја одбранила докторската дисертација со наслов „Процесирање биоелектрични и биоакустични сигнали за предвидување медицински состојби“, стекнувајќи се со научен степен - доктор по информатички науки.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "52",
      "name": "Методија",
      "surname": "Јанчески",
      "email": "metodija.jancheski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/prof._d-r_metodija_jancheski.jpg?itok=vAqXGJ_W",
      "description": "",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "53",
      "name": "Ристе",
      "surname": "Стојанов",
      "email": "riste.stojanov@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/doc._d-r_riste_stojanov20701.jpg?itok=cbdA7M3Z",
      "description": "Роден е 1985 година во Штип. Дипломирал на Факултетот за електротехника и информациски технологии во Скопје во 2008 година, на насоката информатика и компјутерско инженерство. Магистрирал на истиот факултет во 2010 година, со магистерска теза од областа на семантички веб технологии. Во текот на факултетското образование редовно бил наградуван за успешните студии. Првото работно искуство му било во дооел “Генреп” од 2008 година. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје почнал да работи од 2009 година како демонстратор. Неговите наставни обврски опфаќаат изведување вежби по предмети од областа на системски софтвер, мрежно програмирање и мрежен софтвер. Во рамките на досегашната научно-истражувачка работа има објавено десет научно-истражувачки трудови. Коавтор е на една книга. Полињата на научно-истражувачки интерес вклучуваат шеми за дизајн, семантички веб, паралелно процесирање, дистрибуирани системи, компјутерски мрежи, обработка на неструктурирани податоци.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "54",
      "name": "Александра",
      "surname": "Дединец",
      "email": "aleksandra.kanevche@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/doc._d-r_aleksandra_dedinec_20695.jpg?itok=gy8IQDQo",
      "description": "Родена е 1987 година во Белград, Р Србија. Дипломирала на Факултетот за електротехника и информациски технологии во Скопје во 2009 година на насоката Информатика и компјутерско инженерство. Магистрирала на истиот факултет во 2011 година на насоката Компјутерски мрежи и е-технологии, со магистерска теза од областа на моделирање и анализа на сложени мрежни системи. Во текот на факултетското образование била континуирано наградувана за успешното студирање. Учествува во реализација на еден меѓународен проект и има презентирано труд на меѓународна конференција и учествувала на две меѓународни работилници. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје почнала да работи во 2009 година како демонстратор. Нејзините наставни обврски опфаќаат изведување на аудиториски и лабораториски вежби по предметите од областа на логички кола и дискретни автомати и формални јазици. Области на нејзин научно-истражувачки интерес се оптимизација, анализа и моделирање на мрежни системи, формални јазици, логички кола и дискретни автомати, надежност на системи.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "55",
      "name": "Емил",
      "surname": "Станков",
      "email": "emil.stankov@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/doc._d-r_emil_stankov_20697.jpg?itok=l53zOg-f",
      "description": "Роден е 1982 година, во Скопје. Основно образование завршил во ОУ „Ѓорѓија Пулевски“, а средно образование во ДСУ „Раде Јовчевски - Корчагин“ во Скопје, со континуиран одличен успех. Во 2001 година запишал студии по информатика, применета насока, на Природно-математичкиот факултет (ПМФ) при Универзитетот „Св. Кирил и Методиј“ во Скопје. Студиите ги завршил во 2007 година, со одбрана на дипломската работа под наслов „Онтологии и методологија за нивен развој“. Во 2008 година запишал постдипломски студии по информатика на ПМФ, насока Вештачки интелигентни системи, кои што ги продолжил на Факултетот за Информатички Науки и Компјутерско Инженерество (ФИНКИ) во 2011 година. Студиите ги завршил во 2013 година, со одбрана на магистерскиот труд под наслов „Оценување на перформанси на програмски кодови преку методи на податочно рударење“, стекнувајќи се со звање магистер по информатички науки. Од октомври 2013 година е студент на докторските студии на ФИНКИ, студиска програма Информатика.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "56",
      "name": "Бобан",
      "surname": "Јоксимоски",
      "email": "boban.joksimoski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/doc_d-r_boban_joksimoski_20691.jpg?itok=XOHGAsYU",
      "description": "Роден е 1986 година во Скопје. Дипломирал на Факултетот за електротехника и информациски технологии во 2008 година. Моментално е запишан на магистерски студии на студиската програма Софтверско инженерство на истиот факултет. По дипломирањето кратко работел како соработник на Факултетот за информатика при Европскиот универзитет и како 2Д/3Д компјутерски аниматор, веб и апликациски програмер. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје почнал да работи во 2009 год. како демонстратор. Одговорен е за изведување на аудиториски и лабораториски вежби по предметите од областа на структурирано програмирање, објектно-ориентирано програмирање, компјутерска графика, веб дизајн и компјутерска анимација. Член е на IEEE. Области на негов научно-истражувачки интерес се компјутерска графика, визуелизација, географски информациони системи и примена на информациски системи во медицината.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "57",
      "name": "Илинка",
      "surname": "Иваноска",
      "email": "ilinka.ivanoska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/doc_d-r_ilinka_ivanoska20692.jpg?itok=T2_nNjX9",
      "description": "Родена е 1986 година во Скопје. Дипломирала на Факултетот за електротехника и информациски технологии во Скопје во 2009. Во моментов е запишана на магистерски студии на истиот факултет на насоката Содржинско базирано пребарување. Во текот на факултетското образование била континуирано наградувана за успешното студирање. Како студент во 2005 година е добитник на наградата “13 Ноември” од град Скопје за постигнати забележителни успеси во образованието. Таа своето прво работно искуство го стекнала во друштвото за информатички услуги “Некстсенс“ доо. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје почнала да работи во 2009 година како демонстратор.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "58",
      "name": "Бојан",
      "surname": "Илијоски",
      "email": "bojan.ilijoski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/m-r_bojan_ilijoski_20709.jpg?itok=1MKY0qZc",
      "description": "Бојан Илијоски е роден во 1987 во Скопје. Основно образование завршил во ОУ ,,Мирче Ацев” во Скопје, а средно образование во гимназија ,,Никола Карев” во Скопје, математичко подрачје. Во 2006 година се запишал на Природно-математичкиот факултет во Скопје, на институтот за информатика, насока програмско инженерство. Дипломирал во 2010 при што се стекнaл со стручен назив димпломиран инженер по информатика – програмско инженерство. За време на високото образование учествувал на повеќе натпревари во програмирање и кострукција и менаџирање на софтверски проекти. Во септември 2010 се запишaл на постдиплмоските студии при Институтот за информатика на Природно-математичкиот факултет, насока компјутерски науки. Магистрирал во декември 2013 на тема „Групирање на коментари на македонски јазик“ кај менторот проф.д-р. Жанета Попеска. Од 2009 е активен како демонстратор на Интитутот за информатика при Природно-математичкиот факултет, со задолжение за држење на лабораториски вежби по предметите основи на програмирање, објектно и визуелно програмирање, структури на податоци и алгоритми, структури на податоци, интернет технологии и интеракција човек-компјутер. Области на неговиот научно-истражувачки интерес се интелигентни системи, податочно рударство, рударење низ текст, бази на податоци, алгоритми, грид пресметување, пресметување со високи перформанси.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "59",
      "name": "Костадин",
      "surname": "Мишев",
      "email": "kostadin.mishev@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/m-r_kostadin_mishev_20713.jpg?itok=M_Hs7ELq",
      "description": "Роден е 1990 година во Скопје. Основно и средно образование завршил во Неготино. Во текот на средното образование освојува бројни награди на државни натпревари по информатика, физика и математика. Дипломира во 2013 година на Факултетот за информатички науки и компјутерско инженерство на смерот Информатика и компјутерско инженерство (ИКИ) со просек 9.72. Во текот на студирањето континуирано е наградуван за успешно студирање. Во 2016 година, на Факултетот за информатички науки и компјутерско инженерство ја одбранил магистерската теза и се стекнал со звањето магистер по информатички науки и компјутерско инженерство од областа на компјутерските мрежи и е-технологиите. На докторски студии се запишува во септември 2017 на смерот Компјутерски науки на Факултетот за информатички науки и инженерство.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "Д-р "
    },
    {
      "id": "60",
      "name": "Александар",
      "surname": "Тенев",
      "email": "aleksandar.tenev@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/d-r._aleksandar_tenev.jpg?itok=OiokoVMi",
      "description": "Роден е 1988 година во Струмица. Дипломирал на Факултетот за електротехника и информациски технологии во Скопје во 2010. Запишан е на магистерски студии на истиот факултет во 2010. Магистерските студии му се од областа на биоинформатика. Во текот на факултетското образование бил постојано наградуван за постигнатиот успех во студирањето. На Институтот за компјутерска техника и информатика при Факултетот за електротехника и информациски технологии во Скопје почнал да работи во 2009 година како демонстратор. Неговите обврски околу наставата опфаќаат изведување аудиториски и лабораториски вежби по предмети од областа на структурирано програмирање, објектно-ориентирано програмирање, вовед во интернет и програмски методологии. Области на неговиот научно-истражувачки интерес се машинско учење и вештачка интелигенција, невронаука (функционална и анатомска конективност кај човековиот мозок) и биоинформатика (структура на ДНК и протеински интеракции).",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "M-р "
    },
    {
      "id": "61",
      "name": "Александар",
      "surname": "Стојменски",
      "email": "aleksandar.stojmenski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/m-r_aleksandar_stojmenski.jpg?itok=yM9Sbku_",
      "description": "м-р Александар Стојменски е роден во Скопје. Основното образование го завршил во ОУ „Јохан Хајнрих Песталоци“ во Скопје. Средното образование го завршил во СУГС „Георги Димитров “ во Скопје. На студиите по информатика се запишал во учебната 2011/2012 година на Факултетот за информатички науки и компјутерско инженерство (ФИНКИ). Дипломирал во редовен рок, со просечна оценка 9,74, во јули 2015. Добитник е на награда за најдобар дипломски труд на ФИНКИ, доделена од здружението ЕТАИ. Магистрирал во 2016, со одбранет магистерски труд со наслов „Надградена паметна околина за живеење наменета за лица со посебни потреби“, на Факултетот за информатички науки и компјутерско инженерство во Скопје, со што се стекнал со звањето магистер по информатички науки и компјутерско инженерство – област: софтверско инженерство. Во учебната 2017/2018 се запишал на докторски студии на ФИНКИ.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": "M-р "
    },
    {
      "id": "62",
      "name": "Ненад",
      "surname": "Анчев",
      "email": "nenad.anchev@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/m-r_ass._nenad_anchev_20708.jpg?itok=gCzhHIAu",
      "description": "Ненад Анчев е роден 1990 година во Штип. Основно образование завршува во ОУ Гоце Делчев како првенец на генерацијата. Средното образование го завршува во Гимназија Славчо Стојменски, со бројни учества и награди на натпревари по информатика, математика и физика, меѓу кои и учество на меѓународната олимпијада по информатика во Египет во 2008 година. Дипломира на ФИНКИ во 2013 на насока компјутерски архитектури и мрежи со просек 9,72 на тема „Анализа на техники за оптимизација и паралелизација на алгоритам за множење на матрици“. Во учебната 2012/13 година помага при изведување на лабораториските вежби на ФИНКИ по предметите концепти за развој на софтвер и архитектура на компјутери. Дел од магистерските студии ги следи на универзитетот RWTH Aachen во Германија на програмата за симулациски науки, како стипендист на DAAD. Таму во 2014 и 2015 работи како помлад истражувачки асистент на Julich Aachen Research Alliance во одделот за пресметување со високи перформанси. Во периодот од 2016-2018 работи во Сорсикс во тимот за податочни науки и анализа на податоци. Од 2019 е ангажиран на ФИНКИ како демонстратор за изведување на аудиториски и лабораториски вежби по неколку предмети.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": " "
    },
    {
      "id": "63",
      "name": "Војдан",
      "surname": "Ќорвезироски",
      "email": "vojdan.kjorveziroski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/ass._vojdan_kjorveziroski_20672.jpg?itok=fHYjXFsN",
      "description": "Роден е 1996 година во Скопје, каде што ги завршил основното и средното образование. Дипломирал на Факултетот за информатички науки и компјутерско инженерство во Скопје во 2019 година на насоката Мрежни технологии. Запишан е на магистерски студии во 2019 година, насока Интернет технологии. Во текот на додипломските студии бил континуирано наградуван за постигнатите резултати. Учествува во реализација на два меѓународни проекта. На Факултетот за информатички науки и компјутерско инженерство во Скопје почнал да работи во 2018 година како помал демонстратор. Неговите наставни обврски опфаќаат изведување на аудиториски и лабораториски вежби по предметите од областа на компјутерските мрежи и сајбер безбедноста. Области на научно-истражувачки интерес се компјутерски мрежи, дистрибуирани системи, апликативен софтвер и сајбер безбедност.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": " "
    },
    {
      "id": "64",
      "name": "Мартина",
      "surname": "Тошевска",
      "email": "martina.toshevska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/ass._martina_toshevska_20675.jpg?itok=Q64JqTec",
      "description": "Мартина Тошевска е родена во 1995 год. во Скопје. Основно и средно образование завршила во Скопје со континуиран одличен успех. Во 2014 год. се запишала на Факултетот за информатички науки и компјутерско инженерство во Скопје, на студиската програма Компјутерски науки и инженерство. Во текот на студирањето е наградувана како дел од најдобрите студенти на ФИНКИ. Дипломира во 2018 год. со просечна оцена 9,70, со дипломски труд на тема „Креирање описи на медицински слики со техники на длабоко учење“. Во 2018 год. се запишала на постдипломските студии на Факултетот за информатички науки и компјутерско инженерство во Скопје на насоката Интелигентни системи. Магистрира во 2019 година со просечна оцена 10,00, со магистерски труд на тема „Автоматско креирање на стилизиран текст со длабоки невронски архитектури“.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": " "
    },
    {
      "id": "65",
      "name": "Влатко",
      "surname": "Спасев",
      "email": "vlatko.spasev@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/mr._ass._vlatko_spasev_20714.jpg?itok=bv0YGfdK",
      "description": "Влатко Спасев е роден во 1997 година во Свети Николе. Основното училиште во ООУ,,Кирил и Методиј” а средното во СОУ,,Кочо Рацин” во Свети Николе ги завршил како првенец на генерацијата. Во текот на школувањето, учествувал на повеќе регионални и државни натпревари во различни области и има освоено повеќе награди и признанија. На Факултетот за Информатички Науки и Компјутерско Инженерство се запишал во 2015 година на насоката Компјутерски науки и инженерство. Во текот на студирањето има добиено признание како еден од најдобрите студенти на ФИНКИ. Дипломирал во 2019 година со просечна оценка 9,53 со дипломска тема ,,Систем за управување со камери за мониторирање на рути”. Во учебната 2019/2020 се запишува на постдипломски студии на ФИНКИ, насока Софтверско инженерство. Во март 2018 е избран за лаборант на ФИНКИ и изведувал лабораториски вежби по неколку предмети.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": " "
    },
    {
      "id": "66",
      "name": "Петар",
      "surname": "Секулоски",
      "email": "petar.sekuloski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/petar_sekuloski_demonstrator20716.jpg?itok=SCem162t",
      "description": "Петар Секулоски е роден во 1994 година во Струга. Во 2013 година се запишал на Факултетот за информатички науки и компјутерско инженерство, насока компјутерски науки и инженерство. Дипломирал во 2017 година при што се стекнал со титулата дипломиран инженер по информатички науки и компјутерско инженерство, насока компјутерски науки и инженерство. Студент е на постдипломските студии на Факултетот за информатички науки и компјутерско инженерство од 2017, на насокота Компјутерски науки. На Факултетот за информатички науки и компјутерско инженерство најпрво бил ангажиран како лаборант, а од октомври 2018 година како демонстратор. Неговиот ангажман претежно ги опфаќа математичките предмети.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": " "
    },
    {
      "id": "67",
      "name": "Стефан",
      "surname": "Андонов",
      "email": "stefan.andonov@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/ass._stefan_andonov_20673.jpg?itok=Smbpkr7b",
      "description": "Стефан Андонов е роден 1997 година во Неготино, каде што го завршува своето основно и средно образование. Во 2015 година се запишува на додипломски студии на ФИНКИ на насоката компјутерски науки и инженерство (КНИ). Дипломира во октомври 2019 година со просечна оценка 9.38 со дипломскиот труд „Динамички конфигурирана статистичка анализа на податоци со Apache Flink“ под менторство на вонр. проф. д-р Ѓорѓи Маџаров. Во март 2018 е избран за помлад демонстратор и изведувал лабораториска настава на ФИНКИ како лаборант на повеќе предмети на ФИНКИ. Во ноември 2019 година е избран во наставно звање демонстратор на ФИНКИ и изведува настава по предметите Стуктурно програмирање, Објектно-ориентирано програмирање, Напредно програмирање, Софтверско инженерство, Визуелно програмирање, Вовед во компјутерски науки и Криптографија.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": " "
    },
    {
      "id": "68",
      "name": "Ана",
      "surname": "Тодоровска",
      "email": "ana.todorovska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/ass._ana_todorovska_20669.jpg?itok=y1U3amQR",
      "description": "Ана Тодоровска е родена во 1998 година во Битола. Основно и средно образование завршила во Битола со континуриан одличен успех. На додипломски студии на Факултетот за информатички науки и компјутерско инженерство се запишала во 2016 година, на насоката Компјутерски науки и инженерство - англиски јазик. Во текот на студиите изведувала практична работа во компаниите 'Sorsix' Idox Health, а во 2019 година била ангажирана како лаборант на Факултетот за информатички науки и компјутерско инженерство.Дипломирала во 2020 година со дипломскиот труд “Платформа за споделување и изнајмување на облека”, под менторство на проф. д-р Димитар Трајанов.Истата година се запишала на постдипломски студии на Факултетот за информатички науки и компјутерско инженерство, на насоката Управување во информатички технологии. Од декември 2020 година е вработена на Факултетот за информатички науки и компјутерскоинженерство.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": " "
    },
    {
      "id": "69",
      "name": "Јована",
      "surname": "Добрева",
      "email": "jovana.dobreva@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/jovana_dobreva_ass_20705.jpg?itok=Eay5LdUU",
      "description": "Јована Добрева е родена во 1998 година во Скопје, каде завршува средно образование со одличен успех во гимназијата ,,Раде Јовчевски - Корчагин”. Своето високо образование го започнува во 2016 година на Факултетот за информатички науки и компјутерско инженерство на насоката Информатика и компјутерско инженерство. Во четвртата година од студиите (2019 година) е ангажирана како лаборант на факултетот. Непосредно потоа во 2020 година дипломира со просечна оценка 9.70 со дипломскиот труд  ,,Платформа за извлекување на знаење поврзано со лекови од медицински текстови” под менторство на проф. д-р Димитар Трајанов. Своето образование го продолжува во 2020 година со запишување на  постдипломски студии на насоката Управување во информатички технологии. Истата година во декември е вработена на ФИНКИ, каде одржува аудиториски и лабораториски вежби.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": " "
    },
    {
      "id": "70",
      "name": "Јана",
      "surname": "Кузманова",
      "email": "jana.kuzmanova@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/m-r_jana_kuzmanova_20710.jpg?itok=N3x6_R6F",
      "description": "Јана Кузманова е родена во 1994 година во Скопје. Основно и средно образование завршила во Скопје, а во 2013 година се запишува на додипломски студии на Техничкиот Универзитет Минхен. Дипломирала на 19 јули 2017 година со дипломскиот труд „Efficient Formal Arithmetic in  Isabelle/HOL” („Ефикасна формална аритметика во Isabelle/HOL”) под менторство на проф. д-р. Тобиас Нипко. Во учебната година 2017/2018 се запишала на магистерски студии на ФИНКИ, насока Компјутерски науки.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": " "
    },
    {
      "id": "71",
      "name": "Димитар",
      "surname": "Китановски",
      "email": "dimitar.kitanovski@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/dimitar_kitanovski_demonstrator_20693.jpg?itok=ic9lkrFT",
      "description": "Димитар Китановски е роден во 1998 година во Битола. Основно образование завршил во ОУ „Гоце Делчев“ во Ресен, додека средно образование завршил во СОТУ „Ѓорѓи Наумов“ во Битола со континуиран одличен успех. На Факултетот за информатички науки и компјутерско инженерство се запишал во 2016 година. Во текот на последните две години од студиите работел како соработник на Факултетот за информатички науки и компјутерско инженерство. Дипломирал во 2020 година со дипломски труд на тема „Систем за само-евалуација наменет за високо образование“, под менторство на проф. д-р Иван Чорбев. Истата учебна година, 2020/21 се запишува на постдипломски студии на ФИНКИ, на насоката Управување во информатички технологии. Од декември 2020 година е вработен на Факултетот за информатички науки и компјутерско инженерство како демонстратор кој изведува аудиториски и лабораториски вежби.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": " "
    },
    {
      "id": "72",
      "name": "Славе",
      "surname": "Темков",
      "email": "slave.temkov@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/16168410062609048.jpeg?itok=AxRnJSZ7",
      "description": "Славе Темков е роден на 10.01.1999 година, во Кавадарци, Република Северна Македонија. Завршува основно училиште во Кавадарци, Република Северна Македонија, а во гимназијата СОУ Гимназија „Добри Даскалов“ во Кавадарци, завршува средно образование со одличен успех. Своето образование во 2017 година го продолжува на додипломските студии на Факултетот за информатички науки и компјутерско инженерство - Скопје, на насоката Компјутерски науки и инженерство. Дипломира во мај 2022 година со просечна оценка 9.73, со дипломска на тема „Преглед на Magnolia CMS преку практична имплементација на веб сајт“, под менторство на проф. д-р. Иван Китановски. Во учебната година 2022/2023 се запишува на магистерски студии на ФИНКИ, насока Софтверско инженерство. Во октомври 2022 година е избран за демонстратор и изведува аудиториски и лабораториски вежби по предметите Алгоритми и податочни структури, Напреден веб дизајн, Програмирање на видео игри и Методологија на истражувањето во ИКТ.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": " "
    },
    {
      "id": "73",
      "name": "Милена",
      "surname": "Трајаноска",
      "email": "milena.trajanoska@finki.ukim.mk",
      "image": "https://www.finki.ukim.mk/sites/default/files/styles/medium/public/milena_trajanoska27851.jpg?itok=YFZt6rZK",
      "description": "Милена Трајаноска е родена во Скопје 1999 година. Средно образование завршува во гимназијата „Раде Јовчевски - Корчагин“ со одличен успех како првенец на генерација. Дипломира на Факултетот за информатички науки и компјутерско инженерство во 2022 година со дипломски труд „Предвидување на глобални конфликти меѓу држави преку мрежно моделирање на нивните интеракции“ под менторство на проф. д-р Димитар Трајанов. Добитник е на признанието „Инженерски прстен“ и наградена е од универзитетот „Св. Кирил и Методиј“ како најдобар студент на генерацијата. Во учебната 2022/2023 година се запишува на магистерски студии на Факултетот за информатички науки и компјутерско инженерство на насоката Управување во информатички технологии. Во 2023 година во февруари е избрана за демонстратор на факултетот.",
      "grade": 0,
      "votes": 0,
      "reviews": [],
      "status": " "
    }
  ]
}